app/views/museums/show.html.erb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."museum_id" = $1  [["museum_id", 1]]
---
<ul>
  <% @museum.bookings.each do |booking| %>