app/controllers/museums_controller.rb

SELECT "museums".* FROM "museums"
---
  def index
    @museums = Museum.all

INSERT INTO "museums" ("name", "description", "address", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["description", ""], ["address", ""], ["image_url", ""], ["created_at", "2025-03-25 13:44:23.286884"], ["updated_at", "2025-03-25 13:44:23.286884"]]
---
  def create
    @museum = Museum.new(museum_params)
    if @museum.save

SELECT "museums".* FROM "museums" WHERE "museums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_museum
    @museum = Museum.find(params[:id])